# Напишите генератор generate_random_name(), используя модуль random,
# который генерирует два слова из латинских букв от 1 до 15 символов, разделенных пробелами
# Например при исполнении следующего кода:
# gen = generate_random_name()
# print(next(gen))
# print(next(gen))
# print(next(gen))
# print(next(gen))
#
# Выводится:
# tahxmckzexgdyt ocapwy
# dxqebbukr jg
# aym jpvezfqexlv
# iuy qnikkgxvxfxtxv

import random


# Здесь пишем код
def generate_random_name():
    """Генератор выводит строку из двух рандомных слов состоящих из 1-15 букв"""

    a = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l',
         'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
    while True:
        yield f'{" ".join(["".join(random.sample(a, random.randint(1, 15))) for _ in range(2)])}'


gen = generate_random_name()
# print(type(generate_random_name()))
print(next(gen))
print(next(gen))
print(next(gen))
print(next(gen))
print(next(gen))
